<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download latest Tencent meeting client import into Munki.</string>
    <key>Identifier</key>
    <string>com.github.hewei100.munki.TencentMeeting</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TencentMeeting</string>
    	<key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
    	<key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Business</string>
            <key>description</key>
            <string>Tencent cloud meeting client for Mac</string>
            <key>developer</key>
            <string>Tencent</string>
            <key>display_name</key>
            <string>Tencent Meeting</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
	<key>supported_architectures</key>
	<array>
		<string>arm64</string>
	</array>
	<key>installable_condition</key>
	<string>arch == "arm64"</string>
    <key>ParentRecipe</key>
    <string>com.github.hewei100.pkg.TencentMeeting</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>installcheck_script</key>
                    <string><![CDATA[#!/usr/local/munki/munki-python
import os
import sys
from distutils.version import LooseVersion
import plistlib

plist = "/Applications/TencentMeeting.app/Contents/Info.plist"
if not os.path.isfile(plist):
    sys.exit(0)

info = plistlib.readPlist(plist)
installed_version = info['CFBundleVersion']
if '.' not in installed_version:
    installed_version = info['CFBundleShortVersionString'] + '.' + installed_version

offered_version = "%version%"

sys.exit(int(LooseVersion(offered_version) <= LooseVersion(installed_version)))]]></string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
