<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Tencent meeting client disk image and pack it into a pkg.</string>
    <key>Identifier</key>
    <string>com.github.hewei100.pkg.TencentMeeting</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TencentMeeting</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hewei100.download.TencentMeeting</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>CFBundleVersion</key>
                    <string>release</string>
                </dict>
                <key>info_path</key>
                <string>%pathname%/TencentMeeting.app/Contents/Info.plist</string>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%.%release%</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
