<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest SuspiciousPackage release, repacks and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.hewei100.munki.SuspiciousPackage</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SuspiciousPackage</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkg_url</key>
        <string>https://www.mothersruin.com/software/downloads/SuspiciousPackage.dmg</string>
  			<key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Utilities</string>
            <key>description</key>
            <string>An Application for Inspecting macOS Installer Packages</string>
            <key>developer</key>
            <string>Mothers Ruin Software</string>
            <key>display_name</key>
            <string>Suspicious Package</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
	  <key>ParentRecipe</key>
  	<string>com.github.novaksam.pkg.SuspiciousPackage</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>

</dict>
</plist>
