<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>MunkiTools custom settings.</string>
    <key>Identifier</key>
    <string>com.github.hewei100.pkg.MunkiTools_Settings</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MunkiTools_Settings</string>
        <key>VERSION</key>
        <string>2020.05.14</string>
        <key>BUNDLEID</key>
        <string>ef.org.munkitoolssettings</string>
        <key>MUNKI_REPO_URL</key>
        <string>https://munki.efchina.org</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/Input Methods</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PlistEditor</string>
            <key>Arguments</key>
            <dict>
                <key>comment</key>
                <string>Build ManagedInstalls.plist from scratch.</string>
                <key>output_plist_path</key>
                <string>%pkgroot%/Library/Preferences/ManagedInstalls.plist</string>
                <key>plist_data</key>
                <dict>
                    <key>InstallAppleSoftwareUpdates</key>
                    <false/>
                    <key>ShowRemovalDetail</key>
                    <true/>
                    <key>SoftwareUpdateServerURL</key>
                    <string>%MUNKI_REPO_URL%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>force_pkg_build</key>
                <true />
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION%</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                    <key>id</key>
                    <string>%BUNDLEID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Preferences</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Preferences/ManagedInstalls.plist</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
