<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports MunkiTools_Settings pkg into Munki.</string>
    <key>Identifier</key>
    <string>com.github.hewei100.munki.MunkiTools_Settings</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MunkiTools_Settings</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/munkitools</string>
        <key>VERSION</key>
        <string>2020.05.14</string>
        <key>MUNKI_REPO_URL</key>
        <string>https://munki.efchina.org</string>
      	<key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Utilities</string>
            <key>description</key>
            <string>Customized MunkiTools Settings</string>
            <key>developer</key>
            <string>EF China</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hewei100.pkg.MunkiTools_Settings</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%VERSION%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
<!--
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
 -->
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
