<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest SogouPinyin disk image, repacks as a pkg and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.hewei100.SogouPinyin.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SogouPinyin</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/sogou</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Utilities</string>
            <key>description</key>
            <string>Sogou Pinyin Input Source for Mac</string>
            <key>developer</key>
            <string>Sogou</string>
            <key>display_name</key>
            <string>Sogou Pinyin</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hewei100.SogouPinyin.pkg</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
