<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest SogouPinyin disk image and repack it as a pkg with postinstall script.</string>
    <key>Identifier</key>
    <string>com.github.hewei100.SogouPinyin.pkg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SogouPinyin</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hewei100.SogouPinyin.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/Input Methods</key>
                    <string>0755</string>
                    <key>Library/QuickLook</key>
                    <string>0755</string>
                    <key>Library/LaunchAgents</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/installer</string>
                <key>purge_destination</key>
                <true />
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%destination_path%/*.app</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EncryptedZipExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%found_filename%/Contents/Resources/SogouInput.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>archive_password</key>
                <string>MacIME</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/SogouInput.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/SogouInput.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/Input Methods/SogouInput.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/SogouSkinFileQuickLook.qlgenerator</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/QuickLook/SogouSkinFileQuickLook.qlgenerator</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/com.sogou.SogouServices.plist</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/LaunchAgents/com.sogou.SogouServices.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/com.sogou.SogouTaskManager.plist</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/LaunchAgents/com.sogou.SogouTaskManager.plist</string>
            </dict>
        </dict>
        <dict>
            <!-- save a copy of app's built-in install.sh -->
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/install.sh</string>
                <key>destination_path</key>
                <string>%RECIPE_DIR%/install-%version%.sh</string>
            </dict>
        </dict>
        <dict>
            <!-- split original installer script into preflight and postflight -->
            <key>Processor</key>
            <string>SogouInstallScriptSplitter</string>
            <key>Arguments</key>
            <dict>
                <key>install_script</key>
                <string>%RECIPE_CACHE_DIR%/payload/install.sh</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/scripts</string>
            </dict>
        </dict>
        <!--
        <dict>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        -->
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>force_pkg_build</key>
                <true />
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>com.sogou.pinyin.pkg</string>
                    <!--
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    -->
                    <key>scripts</key>
                    <string>%RECIPE_CACHE_DIR%/scripts</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Input Methods</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/Input Methods/SogouInput.app</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>staff</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/QuickLook</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/QuickLook/SogouSkinFileQuickLook.qlgenerator</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>staff</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/LaunchAgents</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/LaunchAgents/com.sogou.SogouServices.plist</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library/LaunchAgents/com.sogou.SogouTaskManager.plist</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
